{
  "('Jinx', '烏鴉嘴')": [
    [
      "He's a Jinx whenever we try to win games.",
      "每次我們想贏遊戲，他就是個烏鴉嘴。"
    ],
    [
      "Calling it perfect will make you a Jinx, honestly.",
      "說它完美真的會讓你變成烏鴉嘴，老實說。"
    ]
  ],
  "('Out of pocket', '自費')": [
    [
      "I'll pay out of pocket for the repairs.",
      "我會自費支付這次維修費。"
    ],
    [
      "They had to go out of pocket for medication.",
      "他們只好自費買藥。"
    ],
    [
      "I went out of pocket covering the extra costs.",
      "我自費支付了額外費用。"
    ]
  ],
  "('Choke up', '哽咽')": [
    [
      "Don't choke up, just tell them how you feel.",
      "別哽咽，直接告訴他們你的感受。"
    ],
    [
      "She'll choke up at her father's speech tonight.",
      "她今晚在爸爸的演講時會哽咽。"
    ]
  ],
  "('Hold a seat', '佔位子')": [
    [
      "I'll hold a seat while you get food.",
      "你去拿食物時，我會幫你佔位子。"
    ],
    [
      "Someone needs to hold a seat near the stage.",
      "有人需要在舞台附近佔位子。"
    ]
  ],
  "('Keep an eye on', '顧個東西的「顧」')": [
    [
      "I'll keep an eye on the kids today.",
      "我今天會顧著小孩。"
    ],
    [
      "Keep an eye on the soup while I cook.",
      "我煮飯時你幫我顧一下湯，好嗎？"
    ]
  ],
  "(\"Hit one's funny bone\", '戳中笑點')": [
    [
      "His silly dance always hits my funny bone instantly.",
      "他那個搞笑的舞蹈總是立刻戳中我的笑點。"
    ],
    [
      "That pun hit her funny bone and she snorted.",
      "那個雙關語戳中她的笑點，她還噴了一聲。"
    ]
  ],
  "('Give someone the eye', '拋媚眼')": [
    [
      "Don't give her the eye if you're taken.",
      "如果你已經有伴，不要對她拋媚眼。"
    ],
    [
      "He keeps giving his coworker the eye daily.",
      "他每天都對同事拋媚眼。"
    ]
  ],
  "('flab', '贅肉')": [
    [
      "She pinched the flab on her waist jokingly.",
      "她開玩笑地捏了捏腰間的贅肉。"
    ],
    [
      "Daily cardio helped shrink the annoying arm flab.",
      "每天的有氧運動幫我縮小惱人的手臂贅肉。"
    ]
  ],
  "('kept man', '小白臉')": [
    [
      "Nobody respects him because he's a kept man.",
      "沒有人尊重他，因為他是個小白臉。"
    ],
    [
      "She prefers a kept man over a struggling partner.",
      "她寧願要個小白臉，也不要辛苦打拼的伴侶。"
    ]
  ],
  "('jump the gun', '操之過急')": [
    [
      "We might jump the gun if we decide now.",
      "如果我們現在就決定，可能會操之過急。"
    ],
    [
      "Don't jump the gun and sign anything yet.",
      "別操之過急，還不要簽任何東西。"
    ],
    [
      "She jumped the gun, starting the meeting without me.",
      "她操之過急，沒等我就開始開會。"
    ],
    [
      "Don't jump the gun — wait for confirmation first.",
      "別操之過急，先等確認再說。"
    ]
  ],
  "('slowpoke', '慢郎中')": [
    [
      "He's a slowpoke when it comes to homework.",
      "他做功課時真是個慢郎中。"
    ],
    [
      "Don't be such a slowpoke, hurry up now.",
      "別當慢郎中了，快點走吧。"
    ],
    [
      "That slowpoke missed the bus again this morning.",
      "那個慢郎中今天早上又錯過公車了。"
    ],
    [
      "Stop acting like a slowpoke and move it.",
      "別再裝成慢郎中，快點動起來。"
    ]
  ],
  "('vicious cycle', '惡性循環')": [
    [
      "Low morale led to mistakes, fueling a vicious cycle.",
      "士氣低落導致錯誤，進而加劇惡性循環。"
    ],
    [
      "We must break the vicious cycle before it worsens.",
      "我們必須在惡化前打破這個惡性循環。"
    ]
  ],
  "('fair-weather friend', '酒肉朋友')": [
    [
      "If trouble comes, my fair-weather friends disappear quickly.",
      "有麻煩時，我的酒肉朋友很快就消失了。"
    ],
    [
      "Don't trust him; he's a fair-weather friend.",
      "別信他；他只是個酒肉朋友。"
    ],
    [
      "A fair-weather friend disappears when things get tough.",
      "遇到困難時，酒肉朋友就會消失。"
    ],
    [
      "I dumped my fair-weather friend after they lied.",
      "他們說謊後，我就跟那個酒肉朋友斷交了。"
    ]
  ],
  "('s', '慢郎中')": [
    [
      "If you're an s, you'll miss the meeting.",
      "如果你當慢郎中，你會錯過會議。"
    ],
    [
      "I hate waiting when someone is such an s.",
      "我討厭等人，尤其是那個慢郎中。"
    ]
  ],
  "('烏鴉嘴',)": [
    [
      "You're such a jinx, cut it out.",
      "你真是個烏鴉嘴，別再這樣了。"
    ],
    [
      "Saying that might jinx our whole plan.",
      "這麼說可能會讓我們整個計畫破功。"
    ]
  ],
  "(\"I'll give you that.\",)": [
    [
      "Fine, I'll give you that—your story makes sense.",
      "好吧，我承認——你的故事有道理。"
    ],
    [
      "Okay, I'll give you that, you warned me earlier.",
      "好，我承認，你早就警告過我。"
    ]
  ],
  "(\"That's a given\",)": [
    [
      "With her resume, that's a given during hiring.",
      "憑她的履歷，錄取時那是理所當然的。"
    ],
    [
      "If she volunteers, I'll help. That's a given.",
      "如果她自願，我會幫忙。那是理所當然的。"
    ],
    [
      "With his experience, that's a given in interviews.",
      "以他的經驗，面試時那是理所當然的。"
    ],
    [
      "You think he'll quit? That's a given, honestly.",
      "你覺得他會辭職？老實說，那是理所當然的。"
    ]
  ],
  "('Learn the ropes',)": [
    [
      "It took me weeks to learn the ropes here.",
      "我花了好幾週才熟悉這裡的工作。"
    ],
    [
      "New hires must learn the ropes before Friday.",
      "新進員工必須在週五前熟悉工作流程。"
    ]
  ],
  "(\"twist one's arm\",)": [
    [
      "She won't buy it unless you twist her arm.",
      "除非你逼她，否則她不會同意。"
    ],
    [
      "Don't twist my arm; I'll help willingly.",
      "別逼我，我會自願幫忙。"
    ]
  ],
  "('Savage',)": [
    [
      "He's a savage on the football field, no mercy.",
      "他在足球場上很兇猛，毫不留情。"
    ],
    [
      "Don't be savage; apologize for what you said.",
      "別那麼野蠻；為你說的話道歉。"
    ]
  ],
  "(\"Don't put yourself out\",)": [
    [
      "If it's too much, don't put yourself out.",
      "如果太吃力，就別太勉強自己。"
    ],
    [
      "Don't put yourself out just to please others.",
      "別為了討好別人而委屈自己。"
    ]
  ],
  "('Sassy',)": [
    [
      "Don't be so sassy with your teacher, okay?",
      "別對老師那麼放肆，好嗎？"
    ],
    [
      "I love her sassy style and bold attitude.",
      "我喜歡她俏皮的風格和大膽的態度。"
    ]
  ],
  "('I have a thing for you',)": [
    [
      "Between us, I have a thing for you.",
      "我們之間，我對你有感覺。"
    ],
    [
      "Honestly, I have a thing for you, can't deny.",
      "老實說，我對你有意思，無法否認。"
    ],
    [
      "I have a thing for you, and it's serious.",
      "我對你有感覺，而且是認真的。"
    ],
    [
      "I have a thing for you; hope that's okay.",
      "我對你有意思，希望你不介意。"
    ]
  ],
  "('Make a scene',)": [
    [
      "He threatened to make a scene over the bill.",
      "他威脅要為了那張帳單大吵大鬧。"
    ],
    [
      "If you call her, she'll probably make a scene.",
      "如果你打給她，她很可能會大吵大鬧。"
    ]
  ],
  "('Hand to god',)": [
    [
      "Hand to god, I'm telling the truth this time.",
      "我向上帝發誓，這次我說的是真的。"
    ],
    [
      "Hand to god, he'll be here before the movie starts.",
      "我向上帝發誓，他會在電影開始前到這裡。"
    ]
  ],
  "('take it in stride',)": [
    [
      "When plans changed, he simply took it in stride.",
      "計畫改變時，他只是從容應對。"
    ],
    [
      "You'll face setbacks; just take it in stride.",
      "你會遇到挫折；只要處之泰然就好。"
    ]
  ],
  "(\"pull one's leg\",)": [
    [
      "I thought she was serious, but she pulled my leg.",
      "我以為她是認真的，但她只是在逗我玩。"
    ],
    [
      "Stop pulling his leg about the job offer, please.",
      "別再拿那份工作逗他了，拜託。"
    ]
  ],
  "('Beats me',)": [
    [
      "Beats me how they managed to finish early.",
      "我搞不懂他們怎麼能提早完成。"
    ],
    [
      "Honestly, beats me what she meant by that.",
      "老實說，我真不知道她那句話是什麼意思。"
    ]
  ],
  "('have someone going',)": [
    [
      "Don't try to have me going like that again.",
      "別再那樣騙我了。"
    ],
    [
      "Her prank had everyone going for a while there.",
      "她的惡作劇一度讓大家都信以為真。"
    ]
  ],
  "(\"You're way off\",)": [
    [
      "Honestly, you're way off with that assumption.",
      "說實話，你那個假設完全錯了。"
    ],
    [
      "You're way off if you think it's simple.",
      "如果你認為這很簡單，那你就大錯特錯。"
    ]
  ],
  "('rainmaker', '搖錢樹')": [
    [
      "We need a rainmaker to boost sales this year.",
      "我們需要一位搖錢樹，來提升今年的銷售。"
    ],
    [
      "His network makes him the team's top rainmaker.",
      "他的人脈讓他成為團隊的頭號搖錢樹。"
    ]
  ],
  "('power trip', '耍官威')": [
    [
      "Stop letting him go on a power trip at work.",
      "別再讓他在公司耍官威了。"
    ],
    [
      "Don't let your boss go on a power trip.",
      "別讓你的老闆耍官威。"
    ]
  ],
  "('PDA (public display of affection)', '放閃')": [
    [
      "Stop the PDA, some people are trying to eat.",
      "別放閃了，有人在努力吃飯。"
    ],
    [
      "Her constant PDA made everyone roll their eyes.",
      "她一直放閃，讓大家翻白眼。"
    ]
  ],
  "('talk back', '頂嘴')": [
    [
      "If she talks back, she'll get grounded this weekend.",
      "如果她頂嘴，就會在這個週末被禁足。"
    ],
    [
      "Why do kids always talk back these days?",
      "現在的小孩為什麼老是頂嘴？"
    ]
  ],
  "('give a hickey', '種草莓')": [
    [
      "She tried to give a hickey but failed.",
      "她試圖種草莓但沒成功。"
    ],
    [
      "I saw them give a hickey under the table.",
      "我看到他們在桌下種草莓。"
    ]
  ]
}