{
  "('Jinx', '烏鴉嘴')": [
    [
      "Every time she walks in, the team's luck flips because she's a total Jinx.",
      "她一進來，團隊的運氣就翻了，真是個十足的烏鴉嘴。"
    ],
    [
      "I hate being a Jinx, I mention plans and they instantly fall apart.",
      "我討厭自己是個烏鴉嘴，只要我一說計畫，它們就立刻全都泡湯。"
    ],
    [
      "Calling someone a Jinx after one mistake just makes everyone nervous and awkward.",
      "把別人說成烏鴉嘴只是讓大家緊張又尷尬。"
    ],
    [
      "We shouldn't say she is a Jinx before the project's even had a chance.",
      "在專案還沒開始前就說她是烏鴉嘴，太不應該了。"
    ],
    [
      "My brother jokingly calls me a Jinx whenever I mention future travel plans.",
      "每次我提到未來旅行計劃，我哥哥就笑著叫我烏鴉嘴。"
    ]
  ],
  "('Out of pocket', '自費')": [
    [
      "I paid the whole procedure out of pocket since insurance didn't cover it.",
      "因為保險不理賠，我只好自費負擔整個療程。"
    ],
    [
      "She decided to travel abroad out of pocket for the special research opportunity.",
      "她決定自費出國，參加那個特別的研究機會。"
    ],
    [
      "If you want premium seating, you'll have to pay out of pocket, I'm afraid.",
      "如果你想要尊榮座位，我恐怕你得自費支付。"
    ]
  ],
  "('flab', '贅肉')": [
    [
      "Those late-night snacks really added flab to my waistline and hips.",
      "那些深夜吃的零食真的讓我的腰和臀部多了些贅肉。"
    ],
    [
      "She blamed the pregnancy for the stubborn flab she still couldn't lose.",
      "她把懷孕當藉口，怪自己仍然減不掉的贅肉。"
    ],
    [
      "I've been doing crunches every morning to try to lose the stubborn flab around my waist.",
      "我每天早上都在做仰臥起坐，想把腰部那頑固的贅肉減掉。"
    ],
    [
      "She joked that the holiday cookies left a little flab on her lower belly.",
      "她開玩笑說節日的餅乾讓她下腹多了點贅肉。"
    ],
    [
      "You can hide flab under thicker clothes, but exercise still helps a lot.",
      "你可以用厚一點的衣服遮住贅肉，但運動仍然很有幫助。"
    ]
  ],
  "('Choke up', '哽咽')": [
    [
      "She tried to smile but began to choke up during her speech.",
      "她想要微笑，但在演講時開始哽咽了。"
    ],
    [
      "Don't choke up now; finish telling the story so we can laugh together.",
      "現在別哽咽，把故事講完，這樣我們才能一起笑。"
    ]
  ],
  "('Hold a seat', '佔位子')": [
    [
      "If the line gets longer, I’ll hold a seat until you finish shopping.",
      "如果隊伍變長，我會幫你佔位子，直到你逛完再回來。"
    ],
    [
      "Hey, can you hold a seat for me while I grab some coffee?",
      "嘿，你可以幫我佔位子嗎？我要去拿杯咖啡。"
    ],
    [
      "If someone else asks, tell them I'll pay to hold a seat here.",
      "如果有人問，就跟他們說我會付錢讓人在這裡幫我佔位子。"
    ],
    [
      "Don't worry, my friend will hold a seat near the stage for us.",
      "別擔心，我朋友會在舞台旁幫我們佔位子。"
    ]
  ],
  "('hypocrite', '偽君子')": [
    [
      "Don't act surprised when people call you a hypocrite for changing your stance.",
      "別假裝驚訝，當大家因你改變立場而叫你偽君子時。"
    ],
    [
      "He pretends to care about the environment but he's a hypocrite through and through.",
      "他假裝很關心環境，但他簡直就是個十足的偽君子。"
    ],
    [
      "If you're constantly criticizing others while doing the same, you are a hypocrite.",
      "如果你老是在批評別人但自己也做同樣的事，那你就是個偽君子。"
    ]
  ],
  "('Give someone the eye', '拋媚眼')": [
    [
      "At the party, she kept trying to give him the eye across the room.",
      "在派對上，她一直試圖在房間那頭向他拋媚眼。"
    ],
    [
      "Don't pretend you didn't notice her give the waiter the eye last night.",
      "別裝作沒發現她昨晚對那位服務生拋媚眼。"
    ],
    [
      "He tried to give his boss the eye, but it only made things awkward.",
      "他試圖對老闆拋媚眼，但只讓場面變得尷尬。"
    ]
  ],
  "('taken', '死會')": [
    [
      "Don't even try flirting with him; he's taken and committed to someone else.",
      "別想去調情他，他已經死會了，對別人很認真且有承諾。"
    ],
    [
      "We should respect boundaries, since my friend is taken and not available.",
      "我們應該尊重界線，我朋友已經死會了，不適合追求。"
    ]
  ],
  "('Be left out', '被冷落')": [
    [
      "Sometimes I seem to be left out even when people invite me, which hurts.",
      "即使別人邀請我，我有時也覺得被冷落，這讓我很受傷。"
    ],
    [
      "If you ignore my messages, I'll begin to be left out and get upset.",
      "如果你忽視我的訊息，我會開始被冷落並且感到難過。"
    ]
  ],
  "('Keep an eye on', '顧個東西的「顧」')": [
    [
      "Please keep an eye on the kids at the pool for the next hour.",
      "請在接下來一小時幫我顧一下泳池邊的孩子們。"
    ],
    [
      "I'll keep an eye on the oven so nothing burns while you're gone.",
      "我會顧著烤箱，確保食物不會燒焦，你出門可以放心。"
    ]
  ],
  "(\"Hit one's funny bone\", '戳中笑點')": [
    [
      "That goofy dance in the video hits the audience's funny bone every single time.",
      "影片裡那個傻氣的舞蹈每次都戳中觀眾的笑點。"
    ],
    [
      "Tell another ridiculous joke; it might hit his funny bone and lighten the mood.",
      "再講個荒謬的笑話吧，說不定會戳中他的笑點，讓氣氛變輕鬆。"
    ]
  ],
  "('Go steady', '穩交')": [
    [
      "I told my friends I'm ready to go steady with someone special now.",
      "我跟朋友說我現在準備好要跟特別的人穩交了。"
    ],
    [
      "If you both like each other, why not go steady and see what happens?",
      "如果你們互相有好感，為什麼不穩交看看會發生什麼事？"
    ]
  ],
  "('get a blister', '起水泡')": [
    [
      "Make sure to tape your heels before long runs, or you'll get a blister.",
      "長跑前記得在腳跟貼膠布，否則會起水泡。"
    ],
    [
      "Don't walk barefoot on hot pavement, otherwise you'll probably get a blister.",
      "不要在燙熱的路面赤腳走，否則很可能會起水泡。"
    ]
  ],
  "('Stand someone up', '放鴿子')": [
    [
      "If you stand someone up, don't be surprised when they stop trusting you.",
      "如果你放鴿子，不要驚訝他們會不再信任你。"
    ],
    [
      "I hate it when friends stand someone up and never offer any real explanation.",
      "我討厭朋友放鴿子，卻從不給出任何真正的解釋。"
    ]
  ],
  "('on the same wavelength', '頻率很合')": [
    [
      "After talking for an hour, I realized we were on the same wavelength creatively.",
      "聊了一個小時後，我發現我們在創意上頻率很合。"
    ],
    [
      "It's rare to meet someone you're on the same wavelength with so quickly.",
      "這麼快就遇到一個和你頻率很合的人很少見。"
    ]
  ],
  "('Got cheated on', '被劈腿了')": [
    [
      "She got cheated on and didn't tell anyone until months had passed, sadly.",
      "她被劈腿了，但過了好幾個月才告訴別人，真可惜。"
    ],
    [
      "If you got cheated on, remember it's not your fault and seek support.",
      "如果你被劈腿了，記得這不是你的錯，要尋求支持。"
    ]
  ],
  "(\"Lose one's touch\", '退步')": [
    [
      "I used to make perfect shots, but lately I feel I'm losing my touch.",
      "我以前出手都很準，但最近覺得自己技術在退步。"
    ],
    [
      "Don't worry if you miss a few beats; you won't lose your touch forever.",
      "如果你失誤幾次也別擔心；你不會永遠退步的。"
    ]
  ],
  "('kept man', '小白臉')": [
    [
      "He used to resent being a kept man, yet now he's comfortable and content.",
      "他以前討厭當小白臉，但現在反而覺得舒服又滿足。"
    ],
    [
      "When friends visit, they tease him about being a kept man and laugh.",
      "朋友來訪時都會嘲笑他是小白臉，然後大家一起笑鬧。"
    ]
  ],
  "('jump the gun', '操之過急')": [
    [
      "We don't want to jump the gun, so let's wait for official confirmation first.",
      "我們別操之過急，所以先等官方確認再說。"
    ],
    [
      "She almost jumped the gun by announcing the merger, but paused for details.",
      "她差點操之過急就宣佈合併，但還是暫停等細節。"
    ]
  ],
  "('slowpoke', '慢郎中')": [
    [
      "I called him three times, but that slowpoke still hasn't shown up.",
      "我打了他三通電話，但那個慢郎中還沒出現。"
    ],
    [
      "Don't be a slowpoke, hurry up and grab your shoes before we leave.",
      "別當慢郎中了，快點拿鞋，我們要出門了。"
    ],
    [
      "My brother's such a slowpoke that he missed the beginning of the movie.",
      "我哥哥真是個慢郎中，結果錯過了電影的開始。"
    ],
    [
      "If you act like a slowpoke, we'll finish the project way past the deadline.",
      "如果你像個慢郎中，我們會在最後期限之後才完成專案。"
    ]
  ],
  "('vicious cycle', '惡性循環')": [
    [
      "Late payments raise fees, worsen credit, and start a vicious cycle you can't escape.",
      "延遲付款會增加費用、破壞信用，進而開始你無法擺脫的惡性循環。"
    ],
    [
      "Burnout lowers performance, which then increases stress and fuels a vicious cycle at work.",
      "倦怠會降低表現，進而增加壓力，助長職場上的惡性循環。"
    ]
  ],
  "('fair-weather friend', '酒肉朋友')": [
    [
      "Don't trust him too much; he's probably a fair-weather friend who disappears.",
      "別太相信他，他大概是個酒肉朋友，遇事就消失了。"
    ],
    [
      "After the promotion, most coworkers turned into fair-weather friends eager for favors.",
      "升職後，大多數同事都變成了酒肉朋友，熱衷於向你索取好處。"
    ]
  ],
  "('s', '慢郎中')": [
    [
      "Stop acting like an s and pick up the pace, we have deadlines.",
      "別再像個慢郎中一樣拖拖拉拉，快點，我們有截止期限。"
    ],
    [
      "If you're an s about plans, don't be surprised when they change.",
      "如果你對計畫總是像個慢郎中一樣遲緩，變動時別感到驚訝。"
    ]
  ],
  "('別當慢郎中。', \"Don't be a slowpoke.\")": [
    [
      "If you're running late, don't be a slowpoke and move it, please.",
      "如果你要遲到了，別當慢郎中，請快一點。"
    ],
    [
      "Stop dawdling; don't be a slowpoke or you'll miss the beginning.",
      "別再磨蹭了，別當慢郎中，否則你會錯過開始。"
    ]
  ],
  "('烏鴉嘴',)": [
    [
      "Calling him unlucky will only jinx his chances of getting the job, honestly.",
      "說他倒楣只會為他求職的機會招來霉運，老實說。"
    ],
    [
      "We shouldn't talk about the perfect weather; that'll jinx our picnic plans for sure.",
      "我們不該一直說天氣多完美，這樣肯定會為野餐計畫招來霉運。"
    ]
  ],
  "(\"I'll give you that.\",)": [
    [
      "After seeing the numbers, I'll give you that this investment could actually work out well.",
      "看了那些數字之後，我得承認這項投資其實可能會有好結果。"
    ],
    [
      "You handled the negotiation perfectly, I'll give you that, but the price still feels high.",
      "你處理談判很完美，這點我得承認，但價格仍然感覺偏高。"
    ]
  ],
  "(\"That's a given\",)": [
    [
      "With her experience and network, landing that client? That's a given, no question.",
      "以她的經驗和人脈，拿下那個客戶？那是理所當然的，毫無疑問。"
    ],
    [
      "We booked the venue months ago, so the party happening? That's a given.",
      "我們幾個月前就訂好場地了，所以派對會如期舉行？那是理所當然的。"
    ]
  ],
  "(\"twist one's arm\",)": [
    [
      "You don't have to twist his arm; he'll volunteer once he hears the plan.",
      "你不用逼他；他一聽到計畫就會自告奮勇。"
    ],
    [
      "If I twist his arm one more time, he'll probably explode with frustration.",
      "如果我再逼他一次，他可能會氣得爆發。"
    ]
  ],
  "('Learn the ropes',)": [
    [
      "Ask questions early so you can learn the ropes and avoid silly mistakes.",
      "早點多問問題，這樣你才能熟悉狀況，避免犯愚蠢的錯誤。"
    ],
    [
      "I'll shadow Sarah for a month to learn the ropes before leading projects.",
      "我會跟著Sarah觀摩一個月，先熟悉流程再帶領專案。"
    ]
  ],
  "('Savage',)": [
    [
      "After hearing the critic's savage review, she decided to never trust reviews blindly.",
      "看到評論家那篇尖刻無情的影評後，她決定不再盲目相信評論。"
    ],
    [
      "The storm left a savage trail through the town, damaging houses and blocking roads.",
      "暴風在鎮上肆虐，造成房屋受損並阻斷道路。"
    ]
  ],
  "(\"Don't put yourself out\",)": [
    [
      "Don't put yourself out helping me move; I already hired professional movers.",
      "別勞駕幫我搬家；我已經請了專業搬運工。"
    ],
    [
      "Don't put yourself out worrying about the event; everything is already under control.",
      "別為這個活動操心；一切已經在掌控之中。"
    ]
  ],
  "('Sassy',)": [
    [
      "Don't be so sassy with your grandparents when they ask polite questions.",
      "別在長輩問些客氣問題時對他們那麼無禮。"
    ],
    [
      "He gave a sassy wink and walked away from the awkward conversation.",
      "他放肆地眨了眨眼，然後從那場尷尬的對話中走開了。"
    ]
  ],
  "('I have a thing for you',)": [
    [
      "I have a thing for you, so meeting you always brightens my day.",
      "我對你有好感，所以見到你總是讓我心情變好。"
    ],
    [
      "Even though we're friends, I have a thing for you and it's complicated.",
      "即使我們是朋友，我對你有好感，事情有點複雜。"
    ]
  ],
  "('Hand to god',)": [
    [
      "Hand to God, he told me the secret and begged me not to repeat it.",
      "我向上帝發誓，他把祕密告訴我，還央求我別說出去。"
    ],
    [
      "Hand to God, if I forget, remind me before we walk out the door.",
      "我向上帝發誓，如果我忘了，出門前提醒我。"
    ]
  ],
  "('Make a scene',)": [
    [
      "If you make a scene now, we'll never hear the end of it again.",
      "如果你現在大吵大鬧，我們之後就會被念個沒完沒了。"
    ],
    [
      "She threatened to make a scene unless they refunded her ticket immediately.",
      "她威脅說要在那裡大吵大鬧，除非他們馬上把票退給她。"
    ]
  ],
  "('take it in stride',)": [
    [
      "I'm surprised he could take it in stride after getting such bad news yesterday.",
      "我很驚訝他昨天收到那麼糟的消息後還能泰然處之。"
    ],
    [
      "If you take it in stride, you'll learn faster and stress much less overall.",
      "如果你能泰然處之，你會學得更快，整體壓力也會少得多。"
    ]
  ],
  "(\"pull one's leg\",)": [
    [
      "I knew she was pulling my leg when she said she met a celebrity.",
      "當她說她遇到名人時，我就知道她在逗我。"
    ],
    [
      "Stop trying to pull my leg; I heard that crazy rumor already yesterday.",
      "別再逗我了；我昨天就已經聽過那個荒唐的謠言。"
    ]
  ],
  "('Beats me',)": [
    [
      "When they asked who broke the vase, my honest answer was, 'Beats me'.",
      "當他們問誰打破花瓶時，我老實回答說：「我不知道。」"
    ],
    [
      "Beats me how he's managed to finish the project before the tight deadline.",
      "我不知道他怎麼能在緊迫的截止日期前完成這個專案。"
    ]
  ],
  "('have someone going',)": [
    [
      "Don't be angry; he only had you going as a harmless April Fool's joke.",
      "別生氣；他只是把你當作愚人節的無害玩笑騙騙而已。"
    ],
    [
      "Her stories always have us going until the surprising punchline finally arrives.",
      "她的故事總是讓我們信以為真，直到驚人的結局出現為止。"
    ]
  ],
  "(\"You're way off\",)": [
    [
      "Honestly, you're way off about how much that used car is actually worth.",
      "說實話，你對那輛二手車的實際價值完全判斷錯誤。"
    ],
    [
      "If you base decisions on that rumor, you're way off and will regret it.",
      "如果你根據那個謠言做決定，你完全錯了會後悔的。"
    ]
  ]
}