{
  "('Go steady', '穩交')": [
    "指戀情進展到比較穩定、公開的階段，彼此承諾較明確，可以說是穩交",
    "指兩人正式開始穩定交往，感情有共識、不玩曖昧、比較認真在經營關係",
    "兩人互相承諾、關係穩定，像是確定要一起走下去的戀愛狀態，俗稱穩交"
  ],
  "('get a blister', '起水泡')": [
    "走路或穿新鞋受摩擦會起水泡，很痛又麻煩，清潔和保護很重要",
    "因摩擦或燙到造成皮膚起水泡，摸起來會痛或癢，裡面常有透明液體",
    "腳或手因長時間摩擦而起水泡，通常會紅腫、有時會破掉流液，會很不舒服"
  ],
  "('flab', '贅肉')": [
    "指身體多出來、鬆軟的脂肪，比方肚子或大腿的贅肉，看起來沒緊實",
    "日常活動或少運動後堆積的脂肪，運動能減少腰腹或手臂上的贅肉",
    "指身體堆出來的多餘脂肪，像肚子或大腿上鬆軟的贅肉，讓人覺得不結實",
    "口語常說的贅肉，意思是那塊看起來多餘又軟的肉，常讓人想靠運動甩掉"
  ],
  "('Be left out', '被冷落')": [
    "被冷落指在圈子裡被忽略、被排除，大家沒關心你讓人覺得不好過",
    "覺得被冷落、沒被邀請參與，像被排除在外、被當成外人",
    "被冷落就是在朋友群裡被忽略、講話被當空氣，心裡有被遺忘的感覺"
  ],
  "('Talk Back', '頂嘴')": [
    "跟人頂嘴就是回嘴頂撞、嘴硬、不聽大人的話，讓氣氛緊張或被責備",
    "用頂嘴的方式回應長輩或權威，通常帶有不服氣或反駁的語氣",
    "跟別人頂嘴、回嘴就是說出不順從或不尊重的話，常帶挑釁或固執的語氣"
  ],
  "('Keep an eye on', '顧個東西的「顧」')": [
    "就是盯著、照顧、留心某樣東西或狀況，隨時注意，像顧個東西的「顧」",
    "替某人或物看著、不讓它出差錯，負責顧好並留意變化，跟顧個東西的「顧」一樣"
  ],
  "('Hold a seat', '佔位子')": [
    "在餐廳或活動先放東西佔位子，避免座位被別人坐走",
    "先幫人佔位子，等他回來再坐，常用在餐廳或演唱會那種需要排隊的場合",
    "暫時留下位置給別人，像用包包或手機佔位子提醒大家這位有人要回來"
  ],
  "('Stand someone up', '放鴿子')": [
    "約好見面臨時爽約不來，就是放鴿子，會讓人覺得沒誠意又很失望",
    "指約好見面或應邀卻沒來，讓人白等、覺得被放鴿子",
    "用來形容朋友或約會對象爽約失約，讓人尷尬又生氣，就是被放鴿子"
  ],
  "('hypocrite', '偽君子')": [
    "愛裝清高、虛情假意的偽君子，表面好人樣其實心機很重",
    "指表面道德、實際做法不一的人，說一套做一套、讓人看破手腳的偽君子",
    "表面裝得很正經、關心別人，私底下卻自私或虛偽，常被罵作偽君子"
  ],
  "('taken', '死會')": [
    "形容感情上被佔有、關係穩定，口語上常用死會表示沒空",
    "表示有人有對象、感情穩定或已婚，別去追，口語上會說他或她是死會",
    "指某人有固定伴侶、不想被追求或已婚，日常會用死會來描述這種狀況"
  ],
  "(\"Hit one's funny bone\", '戳中笑點')": [
    "形容一句話剛好命中笑點，讓人忍不住笑出聲，真的是被戳中笑點",
    "指一句話或梗剛好戳中笑點，讓人立刻笑出聲或忍不住噗哧一笑",
    "形容某個笑話、表情或動作超級有趣，直接戳中笑點，大家瞬間笑翻"
  ],
  "('throw the game', '打假球')": [
    "形容選手或球隊為了利益故意輸球，也就是打假球，騙球迷跟賭局",
    "指選手或團隊為了賭博或收賄故意輸掉比賽，也就是打假球",
    "比賽中刻意放水、配合比數讓對方贏，俗稱打假球"
  ],
  "('on the same wavelength', '頻率很合')": [
    "意思是彼此理解不用多解釋，互相配合有默契，跟對方相處就是頻率很合",
    "彼此想法、步調都差不多，聊起來超順、做事合得來，感覺頻率很合",
    "有共同頻道，笑點跟價值觀對盤，互相理解速度快，配合度高，真是頻率很合"
  ],
  "('recall', '罷免')": [
    "就是選民發起的罷免程序，透過連署或投票對掌權者做去留裁定，加強民眾的監督權",
    "用公投或投票把不適任的官員罷免掉，讓他們下台、解除公職",
    "民眾透過連署或投票發起罷免，表達不信任並要求撤換官員"
  ],
  "('Give someone the eye', '拋媚眼')": [
    "偷偷或大方地對某人放電、示好，用拋媚眼或深情凝視表達好感，氣氛比較曖昧",
    "用眼神故意盯著別人看，拋媚眼示好或調情，想引起注意",
    "用眼神傳達好感或玩笑，會輕浮或可愛地拋媚眼吸引對方"
  ],
  "('kept man', '小白臉')": [
    "沒經濟能力、靠別人包養或花人錢過日子的男人，就是小白臉",
    "被情人或贊助者包養、靠對方錢生活的男人，俗稱小白臉",
    "生活享受全靠另一半付錢、被人戲稱是小白臉、常帶有依賴意味"
  ],
  "('jump the gun', '操之過急')": [
    "提醒別太操之過急，慢慢來反而能避免錯誤和浪費時間",
    "做事太急、沒等時機就開始，等同操之過急，容易出包或後悔",
    "太操之過急就是想快快做成，結果沒注意細節，反而害自己麻煩"
  ],
  "('slowpoke', '慢郎中')": [
    "罵人動作遲緩、總讓別人等很久的傢伙，也會被叫慢郎中",
    "形容做事慢吞吞、拖拖拉拉的人，就像個慢郎中，常常讓人等到不耐煩",
    "指反應遲緩或效率低的人，常被笑稱為慢郎中，總是慢半拍、跟不上進度"
  ],
  "('vicious cycle', '惡性循環')": [
    "會互相拖累、越搞越糟，最後卡在出不來的惡性循環",
    "指問題互相推波助瀾，越解越糟，搞成惡性循環",
    "就是一個壞情況引出下一個，問題不斷惡化，陷入惡性循環"
  ],
  "('fair-weather friend', '酒肉朋友')": [
    "跟你交情大概只停在吃喝玩樂，遇到麻煩就走、不負責任的酒肉朋友",
    "指只在吃喝玩樂時出現、幫不上忙的朋友，就是那種酒肉朋友，危機來就消失",
    "表面熱絡但沒真交情，只有聚餐時出現的酒肉朋友，遇難不會挺你"
  ],
  "('s', '慢郎中')": [
    "常常猶豫不決、反應慢、做事拖泥帶水的俗稱，朋友會笑稱你是慢郎中"
  ],
  "('烏鴉嘴',)": [
    "形容一句不吉利的話，說完後好像就會發生壞事。",
    "開玩笑或抱怨時講到倒楣事，結果真的出事就被罵烏鴉嘴。"
  ],
  "(\"I'll give you that.\",)": [
    "帶點不情願的肯定，承認對方有某種優點或做得不錯。",
    "在爭論裡表示讓步或妥協，給對方一個小勝利而非全面認同。"
  ],
  "(\"That's a given\",)": [
    "用來說事情是既定事實，大家早就接受或預期會發生。",
    "表示某個條件或前提不用討論，結果自然就會是這樣。"
  ],
  "('Learn the ropes',)": [
    "熟悉行內的門路、眉角和規矩，知道要注意什麼，別踩雷。",
    "從頭學起實際操作，遇到問題有辦法處理，慢慢變得稱職。"
  ],
  "(\"twist one's arm\",)": [
    "半開玩笑、半威脅地說服別人，讓人沒辦法輕易說不。",
    "不是法律上的強迫，多指社交或情緒上用手段勉強同意。"
  ],
  "('Savage',)": [
    "形容人或行為很野蠻、沒規矩，像未開化或粗暴的狀態，通常帶有負面意思。",
    "形容暴力、殘忍或兇猛的舉動，做事毫不留情，可能造成嚴重傷害或破壞。",
    "口語俚語用法指超猛、很厲害或無情的表現，帶誇張讚嘆或狠勁意味。"
  ],
  "(\"Don't put yourself out\",)": [
    "免驚，我會自己處理，毋免你親自出馬幫忙。",
    "別逞強為我做太多事，免讓自己累着。"
  ],
  "('Sassy',)": [
    "自信、有態度，做事敢衝敢嗆，常讓人覺得刺激或不太服氣。",
    "調皮愛開玩笑，說話常帶嘲弄或俏皮味道，但有時也很可愛。"
  ],
  "('I have a thing for you',)": [
    "對你有意思，看到你會有特別感覺、被你吸引，常常會在意你。",
    "對你有種情感或性吸引，會想和你更親近，不只是普通朋友的感覺。"
  ],
  "('Make a scene',)": [
    "誇張地表現情緒，演給別人看，讓事情變得更戲劇化。",
    "當眾鬧場或發飆，為了發洩或吸引關注而製造騷動。"
  ],
  "('Hand to god',)": [
    "跟你發誓、講真話，用來強調自己說的是真的。",
    "口語用法：我發誓喔，真的沒騙你，保證說的是事實。",
    "類似「我發誓」，表示拿命擔保或很認真地強調誠實與承諾。"
  ],
  "('have a thing for someone',)": [
    "對某人有曖昧或生理吸引，可能只是短暫心動，也可能發展成愛慕關係。",
    "對某人有好感、心裡會小鹿亂撞，想靠近但未必表白。",
    "暗戀某人，常常想念對方，看到會臉紅或緊張。",
    "對人有點迷戀，會特別關注對方但不一定想交往。"
  ],
  "('take it in stride',)": [
    "把不如意看成小插曲，心態放輕鬆應對。",
    "遇事保持冷靜、從容應付，不讓情緒左右行動。"
  ],
  "(\"pull one's leg\",)": [
    "耍一點小花招逗人反應，讓氣氛變輕鬆、好玩，不是真心要傷害對方。",
    "故意講誇張或假的事騙你一下，屬於惡作劇式的幽默，目的是逗笑。"
  ],
  "('Beats me',)": [
    "毫無頭緒，問我我也說不出來，真搞不清楚。",
    "不知道、猜不到，完全沒有答案，真是想破頭也想不出來。"
  ],
  "('have someone going',)": [
    "故意開玩笑、唬弄別人，讓對方半信半疑或一頭霧水。",
    "牽著別人的情緒和期待走，讓人短暫相信不實或被耍弄。"
  ],
  "(\"You're way off\",)": [
    "在說你猜測或判斷離重點很遠，根本不是那回事，錯得離譜。",
    "表示你方向完全跑掉，和實際情況差距很大，想法不太靠譜。"
  ]
}